{
  "profile": {
    "name": "Võ Thương Trường Nhơn",
    "title": "Software Developer",
    "phone": "+84 xxx-xxx-xxx",
    "email": "vothuongtruongnhon2002@gmail.com",
    "address": "Ho Chi Minh City, Vietnam",
    "portfolio": "https://nhonvo.github.io/profile/",
    "linkedin": "https://www.linkedin.com/in/truongnhon/",
    "github": "https://github.com/nhonvo"
  },
  "education": {
    "year": "2020 - 2024",
    "degree": "Software Engineering",
    "institution": "Ho Chi Minh City University of Technology - HUTECH",
    "gpa": "3.76"
  },
  "expertise": [
    "C#, Js",
    ".NET Core, ASP.NET MVC, Docker, AWS, ReactJs",
    "Postgres, SQL Server, MongoDB"
  ],
  "languages": { "name": "English", "proficiency": 90 },
  "aboutMe": "I love making cool apps for myself and others. I m also a big fan of football, especially Manchester United, and I enjoy watching anime like One Piece. I m a creative person who enjoys both tech and fun hobbies.",
  "experiences": [
    {
      "year": "August 2023 - Now",
      "company": "FPT Software ",
      "location": "Ho Chi Minh",
      "position": "Software developer",
      "description": [
        "Consumer API ",
        "• Developed the Consumer API to manage notifications and schedule vehicle shipments, integrating with the logistic system using the sidecar pattern.",
        "• Designed and implemented an event-driven application with C# and .NET Core, using DynamoDB for fast and efficient data storage. Configured Docker with local stack for local development, building custom service test templates to test the event application.",
        "• Utilized Amazon SQS and SNS to enhance messaging reliability, reducing transaction failures by 40%.",
        "Quoting API",
        "• The Quoting API estimates vehicle shipping costs for customers, providing a reference price before booking.",
        "• Maintained and enhanced existing codebase, designing and implementing RESTful APIs in C# and .NET Core with PostgreSQL. Hosted the application using AWS resources. Participated in code reviews and created comprehensive documentation to ensure code quality and knowledge sharing.",
        "• Improved API response times by 30% through the implementation of Redis caching."
      ]
    },
    {
      "year": "Febuary 2023 - August 2023",
      "company": "FPT Software Company",
      "location": "Ho Chi Minh",
      "position": "Dotnet Fresher",
      "description": [
        "• Conducted in-depth research and practice on C# and the .NET framework, adapting to the software development process.",
        "• Executed projects within the FPT Fresher Management System, a web application designed to manage fresher training. Led a team of 5 fresher students, delegated tasks and contributed to designing the database and backend using the CQRS pattern for efficient development. Conducted research and hosted the application on Azure resources.",
        "• Graduated in the top 2% of the .NET fresher program, showcasing exceptional technical and soft skills."
      ]
    },
    {
      "year": "November 2022 - December 2022",
      "company": "Ho Chi Minh City University of Technology - HUTECH",
      "location": "Ho Chi Minh",
      "position": "Teaching Assistant",
      "description": [
        "Taught freshman students the fundamentals of programming and advanced programming techniques using C/C++. Prepared exercises, reviewed student knowledge, and collaborated closely with the main instructor."
      ]
    }
  ],
  "projects": [
    {
      "year": "Nov 2022 - Dec 2022",
      "name": "Nobita app - Fast Money Transfer App",
      "school": "Ho Chi Minh City University of Technology - HUTECH",
      "position": "Back end developer",
      "description": [
        "- Fast money transfer app that integrates online lucky money service and increases security by block chain. The app implement all api provided by HDBank",
        "- Nobita use flutter to build app, back-end is .net core and sql server, this project won first prize HDBank hackthon competition"
      ]
    },
    {
      "year": "Aug 2022 - Nov 2022 ",
      "name": "Owl trust - Fake news filter",
      "school": "Ho Chi Minh City University of Technology - HUTECH",
      "position": "Back end developer",
      "description": [
        "- Reading news app help user access reliable news. Reliability is based on belief points and calculated by Majority Decision algorithm",
        "- Owl trust use flutter to build app, back-end is .net core and sql server"
      ]
    }
  ],
  "achievement": [
    "- Top 3 GPA in K20 HUTECH Talent Scholarship in 2020",
    "- Top 1 GPA in K20 HUTECH Talent Scholarship  in 2021",
    "- First prizes HDBank hackathon competition",
    "- First prize in It got talent contest at Hutech University"
  ]
}
